fixture/vcr_cassettes/refundtest/refund/get.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "bearer 3285b058e0fd4c559221549a3aa5072f",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/refunds/47401940"
    },
    "response": {
      "binary": false,
      "body": "{\"Id\":\"47401940\",\"Tag\":\"custom meta\",\"CreationDate\":1524259710,\"AuthorId\":\"47401924\",\"CreditedUserId\":null,\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":450},\"CreditedFunds\":{\"Currency\":\"EUR\",\"Amount\":447},\"Fees\":{\"Currency\":\"EUR\",\"Amount\":3},\"Status\":\"SUCCEEDED\",\"ResultCode\":\"000000\",\"ResultMessage\":\"Success\",\"ExecutionDate\":1524259711,\"Type\":\"PAYOUT\",\"Nature\":\"REFUND\",\"InitialTransactionId\":\"47401936\",\"InitialTransactionType\":\"PAYIN\",\"InitialTransactionNature\":\"REGULAR\",\"DebitedWalletId\":\"47401934\",\"CreditedWalletId\":null,\"RefundReason\":{\"RefundReasonMessage\":null,\"RefundReasonType\":\"INITIALIZED_BY_CLIENT\"}}",
      "headers": {
        "Date": "Fri, 20 Apr 2018 21:28:35 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "613",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=dd63dcbf0056ab86eea4871a7990cdf681524259715; expires=Sat, 20-Apr-19 21:28:35 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "330",
        "X-RateLimit-Remaining": "1970",
        "X-RateLimit-Reset": "1524260580",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "40eab3987ac5b765-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]