fixture/vcr_cassettes/refundtest/refund/pay_in/all.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "bearer 3285b058e0fd4c559221549a3aa5072f",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/payins/47401936/refunds"
    },
    "response": {
      "binary": false,
      "body": "[{\"Id\":\"47401940\",\"Tag\":\"custom meta\",\"CreationDate\":1524259710,\"AuthorId\":\"47401924\",\"CreditedUserId\":null,\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":450},\"CreditedFunds\":{\"Currency\":\"EUR\",\"Amount\":447},\"Fees\":{\"Currency\":\"EUR\",\"Amount\":3},\"Status\":\"SUCCEEDED\",\"ResultCode\":\"000000\",\"ResultMessage\":\"Success\",\"ExecutionDate\":1524259711,\"Type\":\"PAYOUT\",\"Nature\":\"REFUND\",\"CreditedWalletId\":null,\"DebitedWalletId\":\"47401934\"}]",
      "headers": {
        "Date": "Fri, 20 Apr 2018 21:28:34 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "424",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=d78e091d50544f417700c3b533a0521bc1524259714; expires=Sat, 20-Apr-19 21:28:34 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "327",
        "X-RateLimit-Remaining": "1973",
        "X-RateLimit-Reset": "1524260580",
        "X-Number-Of-Pages": "1",
        "X-Number-Of-Items": "1",
        "Link": "<https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/payins/47401936/refunds?page=1&per_page=10>; rel=\"first\",<https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/payins/47401936/refunds?page=1&per_page=10>; rel=\"last\"",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "40eab38d1feab765-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]