fixture/vcr_cassettes/refundtest/refund/pay_in/create.json

[
  {
    "request": {
      "body": "{\"Tag\":\"custom meta\",\"Fees\":{\"Currency\":\"EUR\",\"Amount\":3},\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":450},\"AuthorId\":\"47401924\"}",
      "headers": {
        "Authorization": "bearer 3285b058e0fd4c559221549a3aa5072f",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/payins/47401936/refunds"
    },
    "response": {
      "binary": false,
      "body": "{\"Id\":\"47401940\",\"Tag\":\"custom meta\",\"CreationDate\":1524259710,\"AuthorId\":\"47401924\",\"CreditedUserId\":null,\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":450},\"CreditedFunds\":{\"Currency\":\"EUR\",\"Amount\":447},\"Fees\":{\"Currency\":\"EUR\",\"Amount\":3},\"Status\":\"SUCCEEDED\",\"ResultCode\":\"000000\",\"ResultMessage\":\"Success\",\"ExecutionDate\":1524259711,\"Type\":\"PAYOUT\",\"Nature\":\"REFUND\",\"InitialTransactionId\":\"47401936\",\"InitialTransactionType\":\"PAYIN\",\"InitialTransactionNature\":\"REGULAR\",\"DebitedWalletId\":\"47401934\",\"CreditedWalletId\":null,\"RefundReason\":{\"RefundReasonMessage\":null,\"RefundReasonType\":\"INITIALIZED_BY_CLIENT\"}}",
      "headers": {
        "Date": "Fri, 20 Apr 2018 21:28:32 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "613",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=db778544111eaea37e5c786cb2366fe461524259710; expires=Sat, 20-Apr-19 21:28:30 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "322",
        "X-RateLimit-Remaining": "1978",
        "X-RateLimit-Reset": "1524260580",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "40eab3794ce8b765-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]