fixture/vcr_cassettes/refundtest/transfer/create.json

[
  {
    "request": {
      "body": "{\"Tag\":\"custom meta\",\"Fees\":{\"Currency\":\"EUR\",\"Amount\":2},\"DebitedWalletId\":\"47401934\",\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":499},\"CreditedWalletId\":\"47401935\",\"CreditedUserId\":\"47401924\",\"AuthorId\":\"47401924\"}",
      "headers": {
        "Authorization": "bearer 3285b058e0fd4c559221549a3aa5072f",
        "Content-Type": "application/json",
        "User-Agent": "Elixir"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.mangopay.com/v2.01/sdk-unit-tests/transfers"
    },
    "response": {
      "binary": false,
      "body": "{\"Id\":\"47401938\",\"Tag\":\"custom meta\",\"CreationDate\":1524259709,\"AuthorId\":\"47401924\",\"CreditedUserId\":\"47401924\",\"DebitedFunds\":{\"Currency\":\"EUR\",\"Amount\":499},\"CreditedFunds\":{\"Currency\":\"EUR\",\"Amount\":497},\"Fees\":{\"Currency\":\"EUR\",\"Amount\":2},\"Status\":\"SUCCEEDED\",\"ResultCode\":\"000000\",\"ResultMessage\":\"Success\",\"ExecutionDate\":1524259709,\"Type\":\"TRANSFER\",\"Nature\":\"REGULAR\",\"DebitedWalletId\":\"47401934\",\"CreditedWalletId\":\"47401935\"}",
      "headers": {
        "Date": "Fri, 20 Apr 2018 21:28:29 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "437",
        "Connection": "keep-alive",
        "Set-Cookie": "__cfduid=d502f4221246223a405233fa6194b9d4f1524259709; expires=Sat, 20-Apr-19 21:28:29 GMT; path=/; domain=.mangopay.com; HttpOnly",
        "Cache-Control": "no-cache",
        "Pragma": "no-cache",
        "Expires": "-1",
        "X-RateLimit": "320",
        "X-RateLimit-Remaining": "1980",
        "X-RateLimit-Reset": "1524260580",
        "Expect-CT": "max-age=604800, report-uri=\"https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct\"",
        "Server": "cloudflare",
        "CF-RAY": "40eab3701b7db765-CDG"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]